In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/026.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

        0    1    2                     3                   4
0     NaN  NaN  NaN  Norwood (R)  117,721  Holley (D)  57,032
1     NaN  NaN  NaN                 67.4%               32.6%
2  County   PR   TP                   NaN                 NaN
3   BANKS   15   15                  3026                 859
4  CLARKE   26   26                  9318               13486

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2      3      4
3     BANKS  15  15   3026    859
4    CLARKE  26  26   9318  13486
5  COLUMBIA  47  47  24689   6643
6    ELBERT  13  13   2963   1606
7  FRANKLIN  15  15   3256   1628

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0      3      4
3     BANKS   3026    859
4    CLARKE   9318  13486
5  COLUMBIA  24689   6643
6    ELBERT   2963   1606
7  FRANKLIN   3256   1628

In [9]:
df.columns = ['county', 'Charlie Norwood', 'Terry Holley']

In [10]:
df.tail(5)

      county Charlie Norwood Terry Holley
19     RABUN            3342         1488
20  RICHMOND           12608         7212
21  STEPHENS            4601         2051
22     TOWNS            2580         1125
23    WILKES            1684          994

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county        candidate  votes
0     BANKS  Charlie Norwood   3026
1    CLARKE  Charlie Norwood   9318
2  COLUMBIA  Charlie Norwood  24689
3    ELBERT  Charlie Norwood   2963
4  FRANKLIN  Charlie Norwood   3256

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
county       42 non-null object
candidate    42 non-null object
votes        42 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '10'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Charlie Norwood', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Terry Holley', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate        party
Charlie Norwood  Republican    117721
Terry Holley     Democrat       57032
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party        candidate  votes
0     BANKS  U.S. Representative       10  Republican  Charlie Norwood   3026
1    CLARKE  U.S. Representative       10  Republican  Charlie Norwood   9318
2  COLUMBIA  U.S. Representative       10  Republican  Charlie Norwood  24689
3    ELBERT  U.S. Representative       10  Republican  Charlie Norwood   2963
4  FRANKLIN  U.S. Representative       10  Republican  Charlie Norwood   3256

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')